In [22]:
#Import employee_data.csv into a Pandas DataFrame
import pandas as pd
employee_data_df=pd.read_csv('employee_data.csv')

In [23]:
# Output few lines and check the information of the dataset
employee_data_df.head(2)

   Emp ID          Name         DOB          SSN         State
0     232  John Mathews  1991-02-24  289-31-9165  North Dakota
1     533  Nathan Moore  1978-11-19  220-05-7469         Maine

In [24]:
# Split the column for Name into First Name and last Name
employee_data_df['First Name'] = employee_data_df['Name'].apply(lambda x: x.split(" ")[0])
employee_data_df['Last Name'] =  employee_data_df['Name'].apply(lambda x: x.split(" ")[1])

In [25]:
# view to check two added columns
employee_data_df.head(2)

,Emp ID,Name,DOB,SSN,State,First Name,Last Name
0,232,John Mathews,1991-02-24,289-31-9165,North Dakota,John,Mathews
1,533,Nathan Moore,1978-11-19,220-05-7469,Maine,Nathan,Moore

In [26]:
# Remove the column of 'Name' and organize the columnes
employee_data_df = employee_data_df[['Emp ID', 'First Name', 'Last Name', 'DOB', 'SSN', 'State']]

In [27]:
# view to check column removed
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN         State
0     232       John   Mathews  1991-02-24  289-31-9165  North Dakota
1     533     Nathan     Moore  1978-11-19  220-05-7469         Maine

In [28]:
# Change the format of 'DOB' into `MM/DD/YYYY`

employee_data_df['DOB'] = pd.to_datetime(employee_data_df['DOB'])

employee_data_df['DOB'] = employee_data_df['DOB'].dt.strftime('%m/%d/%Y')

In [29]:
# view to check the change
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN         State
0     232       John   Mathews  02/24/1991  289-31-9165  North Dakota
1     533     Nathan     Moore  11/19/1978  220-05-7469         Maine

In [30]:
# Slice the value of column for 'SSN' and keep the last 4 digital and add '***-**-' on the left
employee_data_df['SSN'] = employee_data_df['SSN'].apply(lambda x: "***-**-" + x[7:])

In [31]:
# view to check format change in 'SSN' column
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN         State
0     232       John   Mathews  02/24/1991  ***-**-9165  North Dakota
1     533     Nathan     Moore  11/19/1978  ***-**-7469         Maine

In [32]:
# Python Dictionary for State Abbreviations
us_state_abbrev = {
    'Alabama': 'AL',
    'Alaska': 'AK',
    'Arizona': 'AZ',
    'Arkansas': 'AR',
    'California': 'CA',
    'Colorado': 'CO',
    'Connecticut': 'CT',
    'Delaware': 'DE',
    'Florida': 'FL',
    'Georgia': 'GA',
    'Hawaii': 'HI',
    'Idaho': 'ID',
    'Illinois': 'IL',
    'Indiana': 'IN',
    'Iowa': 'IA',
    'Kansas': 'KS',
    'Kentucky': 'KY',
    'Louisiana': 'LA',
    'Maine': 'ME',
    'Maryland': 'MD',
    'Massachusetts': 'MA',
    'Michigan': 'MI',
    'Minnesota': 'MN',
    'Mississippi': 'MS',
    'Missouri': 'MO',
    'Montana': 'MT',
    'Nebraska': 'NE',
    'Nevada': 'NV',
    'New Hampshire': 'NH',
    'New Jersey': 'NJ',
    'New Mexico': 'NM',
    'New York': 'NY',
    'North Carolina': 'NC',
    'North Dakota': 'ND',
    'Ohio': 'OH',
    'Oklahoma': 'OK',
    'Oregon': 'OR',
    'Pennsylvania': 'PA',
    'Rhode Island': 'RI',
    'South Carolina': 'SC',
    'South Dakota': 'SD',
    'Tennessee': 'TN',
    'Texas': 'TX',
    'Utah': 'UT',
    'Vermont': 'VT',
    'Virginia': 'VA',
    'Washington': 'WA',
    'West Virginia': 'WV',
    'Wisconsin': 'WI',
    'Wyoming': 'WY',
}

In [33]:
# Change the state full name to  abbreviation
employee_data_df['State']= employee_data_df['State'].apply(lambda x: us_state_abbrev[x])

In [34]:
# View to check the change in 'State' column
employee_data_df.head(2)

   Emp ID First Name Last Name         DOB          SSN State
0     232       John   Mathews  02/24/1991  ***-**-9165    ND
1     533     Nathan     Moore  11/19/1978  ***-**-7469    ME

In [35]:
# Save all the change in the original csv file

employee_data_df.to_csv('employee_data.csv',index=False)

In [36]:
df= pd.read_csv('employee_data.csv')

In [37]:
df.head()

   Emp ID First Name  Last Name         DOB          SSN State
0     232       John    Mathews  02/24/1991  ***-**-9165    ND
1     533     Nathan      Moore  11/19/1978  ***-**-7469    ME
2     256     Amanda    Douglas  01/08/1990  ***-**-6961    ID
3     189    Heather    Andrews  08/11/1976  ***-**-1797    VT
4     284     Daniel  Hernandez  07/22/1976  ***-**-7473    CO